Revit 2024 API
Segment.GetSizes Method
 Gets the defined sizes of the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<MEPSize> GetSizes()
Visual Basic
Public Function GetSizes As ICollection(Of MEPSize)
Visual C++
public:
ICollection<MEPSize^>^ GetSizes()
See Also
Segment Class
Autodesk.Revit.DB Namespace